#!usr/bin/env python
#-*- coding:utf-8 _*-
"""
@author:47539
@file: 8.py
@time: 2020/3/10  16:46
"""

# 8 设计一个数据结构，用来存放10个员工的信息并初始化，
# 每个员工信息包括：工号，姓名，工龄，工资；  将这10个员工，按照工资从高到低打印输出；
#   提示：可以组合使用我们的序列数据类型；

list1 = [(120, "Li", 3, 1000),
         (121, "sun", 5, 3456),
         (122, "sunny", 1, 2345),
         (123, "sunshine", 2, 10000),
         (124, "sawyer", 8, 8000),
         (125, "swift", 6, 7000),
         (126, "scort", 7, 6754),
         (127, "sue", 10, 1212),
         (128, "smart", 8, 2121),
         (129, "syn", 3, 3434),]

list1.sort( key=lambda k: k[3], reverse=True )

print("工号 姓名 工龄 工资")
for x in list1:
    print( "%d  %s  %d  %d" %x )